Задача:
Напишите код, после выполнения которого мы получим такой результат:
    
1
22
333
4444
55555
    

Решение 1:
print('''1
22
333
4444
55555''')
    
Решение 2:  
a = 1
b = 22
c = 333
d = 4444
e = 55555
def f(a,b,c,d,e):
    print(a)
    print(b)
    print(c)
    print(d)
    print(e)
    
print(a)
print(b)
print(c)
print(d)
print(e)
