a = '5'
b = 20
c = 23.23
d = bytes(5)
e = [553, 434]
f = ('i', 'j')
g = {-5, -4, -3, 4, 5}
m = frozenset('qwerty')
n = {'Мара': 'мечта'}

print((a,type(a)), (b,type(b)), (c,type(c)), (d,type(d)), (e,type(e)), (f,type(f)), (g,type(g)), (m,type(m)), (n,type(n)))

name = 'Eva'
name2 = 'Adam'
family = str(name) + ' ' + str(name2)

print(family)

item = '555'
item2 = 'world'
print(item, item2)

item = 1
name = 'Eva'
result = str(item) + ' ' + name
print(result)

'''Python. HW_1. 
Part_1

1) Создать переменную типа String
2) Создать переменную типа Integer
3) Создать переменную типа Float
4) Создать переменную типа Bytes
5) Создать переменную типа List
6) Создать переменную типа Tuple
7) Создать переменную типа Set
8. Создать переменную типа Frozen set
9) Создать переменную типа Dict

10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.

11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)'''

